ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
    #define PPSD_PPSD0_MASK             1U
    #define PPSD_PPSD1_MASK             2U
    #define PPSD_PPSD2_MASK             4U
    #define PPSD_PPSD3_MASK             8U
    #define PPSD_PPSD4_MASK             16U
    #define PPSD_PPSD5_MASK             32U
    #define PPSD_PPSD6_MASK             64U
    #define PPSD_PPSD7_MASK             128U
    
  } Overlap_STR;

  struct {
    word PPSD0       :1;                                       /* Port CD pull polarity select 0 */
    word PPSD1       :1;                                       /* Port CD pull polarity select 1 */
    word PPSD2       :1;                                       /* Port CD pull polarity select 2 */
    word PPSD3       :1;                                       /* Port CD pull polarity select 3 */
    word PPSD4       :1;                                       /* Port CD pull polarity select 4 */
    word PPSD5       :1;                                       /* Port CD pull polarity select 5 */
    word PPSD6       :1;                                       /* Port CD pull polarity select 6 */
    word PPSD7       :1;                                       /* Port CD pull polarity select 7 */
    word PPSC0       :1;                                       /* Port CD pull polarity select 0 */
    word PPSC1       :1;                                       /* Port CD pull polarity select 1 */
    word PPSC2       :1;                                       /* Port CD pull polarity select 2 */
    word PPSC3       :1;                                       /* Port CD pull polarity select 3 */
    word PPSC4       :1;                                       /* Port CD pull polarity select 4 */
    word PPSC5       :1;                                       /* Port CD pull polarity select 5 */
    word PPSC6       :1;                                       /* Port CD pull polarity select 6 */
    word PPSC7       :1;                                       /* Port CD pull polarity select 7 */
  } Bits;
  struct {
    word grpPPSD :8;
    word grpPPSC :8;
  } MergedBits;
} PPSCDSTR;
extern volatile PPSCDSTR _PPSCD @0x00000248;
#define PPSCD                           _PPSCD.Word
#define PPSCD_PPSD0                     _PPSCD.Bits.PPSD0
#define PPSCD_PPSD1                     _PPSCD.Bits.PPSD1
#define PPSCD_PPSD2                     _PPSCD.Bits.PPSD2
#define PPSCD_PPSD3                     _PPSCD.Bits.PPSD3
#define PPSCD_PPSD4                     _PPSCD.Bits.PPSD4
#define PPSCD_PPSD5                     _PPSCD.Bits.PPSD5
#define PPSCD_PPSD6                     _PPSCD.Bits.PPSD6
#define PPSCD_PPSD7                     _PPSCD.Bits.PPSD7
#define PPSCD_PPSC0                     _PPSCD.Bits.PPSC0
#define PPSCD_PPSC1                     _PPSCD.Bits.PPSC1
#define PPSCD_PPSC2                     _PPSCD.Bits.PPSC2
#define PPSCD_PPSC3                     _PPSCD.Bits.PPSC3
#define PPSCD_PPSC4                     _PPSCD.Bits.PPSC4
#define PPSCD_PPSC5                     _PPSCD.Bits.PPSC5
#define PPSCD_PPSC6                     _PPSCD.Bits.PPSC6
#define PPSCD_PPSC7                     _PPSCD.Bits.PPSC7
#define PPSCD_PPSD                      _PPSCD.MergedBits.grpPPSD
#define PPSCD_PPSC                      _PPSCD.MergedBits.grpPPSC

#define PPSCD_PPSD0_MASK                1U
#define PPSCD_PPSD1_MASK                2U
#define PPSCD_PPSD2_MASK                4U
#define PPSCD_PPSD3_MASK                8U
#define PPSCD_PPSD4_MASK                16U
#define PPSCD_PPSD5_MASK                32U
#define PPSCD_PPSD6_MASK                64U
#define PPSCD_PPSD7_MASK                128U
#define PPSCD_PPSC0_MASK                256U
#define PPSCD_PPSC1_MASK                512U
#define PPSCD_PPSC2_MASK                1024U
#define PPSCD_PPSC3_MASK                2048U
#define PPSCD_PPSC4_MASK                4096U
#define PPSCD_PPSC5_MASK                8192U
#define PPSCD_PPSC6_MASK                16384U
#define PPSCD_PPSC7_MASK                32768U
#define PPSCD_PPSD_MASK                 255U
#define PPSCD_PPSD_BITNUM               0U
#define PPSCD_PPSC_MASK                 65280U
#define PPSCD_PPSC_BITNUM               8U


/*** PTEF - Port EF Data Register; 0x00000260 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PTE - Port E Data Register; 0x00000260 ***/
    union {
      byte Byte;
      struct {
        byte PTE0        :1;                                       /* Port E general purpose I/O data 0 */
        byte PTE1        :1;                                       /* Port E general purpose I/O data 1 */
        byte PTE2        :1;                                       /* Port E general purpose I/O data 2 */
        byte PTE3        :1;                                       /* Port E general purpose I/O data 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPTE :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PTESTR;
    #define PTE                         _PTEF.Overlap_STR.PTESTR.Byte
    #define PTE_PTE0                    _PTEF.Overlap_STR.PTESTR.Bits.PTE0
    #define PTE_PTE1                    _PTEF.Overlap_STR.PTESTR.Bits.PTE1
    #define PTE_PTE2                    _PTEF.Overlap_STR.PTESTR.Bits.PTE2
    #define PTE_PTE3                    _PTEF.Overlap_STR.PTESTR.Bits.PTE3
    #define PTE_PTE                     _PTEF.Overlap_STR.PTESTR.MergedBits.grpPTE
    
    #define PTE_PTE0_MASK               1U
    #define PTE_PTE1_MASK               2U
    #define PTE_PTE2_MASK               4U
    #define PTE_PTE3_MASK               8U
    #define PTE_PTE_MASK                15U
    #define PTE_PTE_BITNUM              0U
    

    /*** PTF - Port F Data Register; 0x00000261 ***/
    union {
      byte Byte;
      struct {
        byte PTF0        :1;                                       /* Port F general purpose I/O data 0 */
        byte PTF1        :1;                                       /* Port F general purpose I/O data 1 */
        byte PTF2        :1;                                       /* Port F general purpose I/O data 2 */
        byte PTF3        :1;                                       /* Port F general purpose I/O data 3 */
        byte PTF4        :1;                                       /* Port F general purpose I/O data 4 */
        byte PTF5        :1;                                       /* Port F general purpose I/O data 5 */
        byte PTF6        :1;                                       /* Port F general purpose I/O data 6 */
        byte PTF7        :1;                                       /* Port F general purpose I/O data 7 */
      } Bits;
    } PTFSTR;
    #define PTF                         _PTEF.Overlap_STR.PTFSTR.Byte
    #define PTF_PTF0                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF0
    #define PTF_PTF1                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF1
    #define PTF_PTF2                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF2
    #define PTF_PTF3                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF3
    #define PTF_PTF4                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF4
    #define PTF_PTF5                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF5
    #define PTF_PTF6                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF6
    #define PTF_PTF7                    _PTEF.Overlap_STR.PTFSTR.Bits.PTF7
    
    #define PTF_PTF0_MASK               1U
    #define PTF_PTF1_MASK               2U
    #define PTF_PTF2_MASK               4U
    #define PTF_PTF3_MASK               8U
    #define PTF_PTF4_MASK               16U
    #define PTF_PTF5_MASK               32U
    #define PTF_PTF6_MASK               64U
    #define PTF_PTF7_MASK               128U
    
  } Overlap_STR;

