ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
  struct {
    word PPSF0       :1;                                       /* Port EF pull polarity select 0 */
    word PPSF1       :1;                                       /* Port EF pull polarity select 1 */
    word PPSF2       :1;                                       /* Port EF pull polarity select 2 */
    word PPSF3       :1;                                       /* Port EF pull polarity select 3 */
    word PPSF4       :1;                                       /* Port EF pull polarity select 4 */
    word PPSF5       :1;                                       /* Port EF pull polarity select 5 */
    word PPSF6       :1;                                       /* Port EF pull polarity select 6 */
    word PPSF7       :1;                                       /* Port EF pull polarity select 7 */
    word PPSE0       :1;                                       /* Port EF pull polarity select 0 */
    word PPSE1       :1;                                       /* Port EF pull polarity select 1 */
    word PPSE2       :1;                                       /* Port EF pull polarity select 2 */
    word PPSE3       :1;                                       /* Port EF pull polarity select 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpPPSF :8;
    word grpPPSE :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} PPSEFSTR;
extern volatile PPSEFSTR _PPSEF @0x00000268;
#define PPSEF                           _PPSEF.Word
#define PPSEF_PPSF0                     _PPSEF.Bits.PPSF0
#define PPSEF_PPSF1                     _PPSEF.Bits.PPSF1
#define PPSEF_PPSF2                     _PPSEF.Bits.PPSF2
#define PPSEF_PPSF3                     _PPSEF.Bits.PPSF3
#define PPSEF_PPSF4                     _PPSEF.Bits.PPSF4
#define PPSEF_PPSF5                     _PPSEF.Bits.PPSF5
#define PPSEF_PPSF6                     _PPSEF.Bits.PPSF6
#define PPSEF_PPSF7                     _PPSEF.Bits.PPSF7
#define PPSEF_PPSE0                     _PPSEF.Bits.PPSE0
#define PPSEF_PPSE1                     _PPSEF.Bits.PPSE1
#define PPSEF_PPSE2                     _PPSEF.Bits.PPSE2
#define PPSEF_PPSE3                     _PPSEF.Bits.PPSE3
#define PPSEF_PPSF                      _PPSEF.MergedBits.grpPPSF
#define PPSEF_PPSE                      _PPSEF.MergedBits.grpPPSE

#define PPSEF_PPSF0_MASK                1U
#define PPSEF_PPSF1_MASK                2U
#define PPSEF_PPSF2_MASK                4U
#define PPSEF_PPSF3_MASK                8U
#define PPSEF_PPSF4_MASK                16U
#define PPSEF_PPSF5_MASK                32U
#define PPSEF_PPSF6_MASK                64U
#define PPSEF_PPSF7_MASK                128U
#define PPSEF_PPSE0_MASK                256U
#define PPSEF_PPSE1_MASK                512U
#define PPSEF_PPSE2_MASK                1024U
#define PPSEF_PPSE3_MASK                2048U
#define PPSEF_PPSF_MASK                 255U
#define PPSEF_PPSF_BITNUM               0U
#define PPSEF_PPSE_MASK                 3840U
#define PPSEF_PPSE_BITNUM               8U


/*** PTADL - Port ADL Data Register; 0x00000281 ***/
typedef union {
  byte Byte;
  struct {
    byte PTADL0      :1;                                       /* Port ADL general purpose I/O data 0 */
    byte PTADL1      :1;                                       /* Port ADL general purpose I/O data 1 */
    byte PTADL2      :1;                                       /* Port ADL general purpose I/O data 2 */
    byte PTADL3      :1;                                       /* Port ADL general purpose I/O data 3 */
    byte PTADL4      :1;                                       /* Port ADL general purpose I/O data 4 */
    byte PTADL5      :1;                                       /* Port ADL general purpose I/O data 5 */
    byte PTADL6      :1;                                       /* Port ADL general purpose I/O data 6 */
    byte PTADL7      :1;                                       /* Port ADL general purpose I/O data 7 */
  } Bits;
} PTADLSTR;
extern volatile PTADLSTR _PTADL @0x00000281;
#define PTADL                           _PTADL.Byte
#define PTADL_PTADL0                    _PTADL.Bits.PTADL0
#define PTADL_PTADL1                    _PTADL.Bits.PTADL1
#define PTADL_PTADL2                    _PTADL.Bits.PTADL2
#define PTADL_PTADL3                    _PTADL.Bits.PTADL3
#define PTADL_PTADL4                    _PTADL.Bits.PTADL4
#define PTADL_PTADL5                    _PTADL.Bits.PTADL5
#define PTADL_PTADL6                    _PTADL.Bits.PTADL6
#define PTADL_PTADL7                    _PTADL.Bits.PTADL7

#define PTADL_PTADL0_MASK               1U
#define PTADL_PTADL1_MASK               2U
#define PTADL_PTADL2_MASK               4U
#define PTADL_PTADL3_MASK               8U
#define PTADL_PTADL4_MASK               16U
#define PTADL_PTADL5_MASK               32U
#define PTADL_PTADL6_MASK               64U
#define PTADL_PTADL7_MASK               128U


/*** PTIADL - Port ADL Input Register; 0x00000283 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIADL0     :1;                                       /* Port ADL data input 0 */
    byte PTIADL1     :1;                                       /* Port ADL data input 1 */
    byte PTIADL2     :1;                                       /* Port ADL data input 2 */
    byte PTIADL3     :1;                                       /* Port ADL data input 3 */
    byte PTIADL4     :1;                                       /* Port ADL data input 4 */
    byte PTIADL5     :1;                                       /* Port ADL data input 5 */
    byte PTIADL6     :1;                                       /* Port ADL data input 6 */
    byte PTIADL7     :1;                                       /* Port ADL data input 7 */
  } Bits;
} PTIADLSTR;
extern volatile PTIADLSTR _PTIADL @0x00000283;
#define PTIADL                          _PTIADL.Byte
#define PTIADL_PTIADL0                  _PTIADL.Bits.PTIADL0
#define PTIADL_PTIADL1                  _PTIADL.Bits.PTIADL1
#define PTIADL_PTIADL2                  _PTIADL.Bits.PTIADL2
#define PTIADL_PTIADL3                  _PTIADL.Bits.PTIADL3
#define PTIADL_PTIADL4                  _PTIADL.Bits.PTIADL4
#define PTIADL_PTIADL5                  _PTIADL.Bits.PTIADL5
#define PTIADL_PTIADL6                  _PTIADL.Bits.PTIADL6
#define PTIADL_PTIADL7                  _PTIADL.Bits.PTIADL7

