ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
#define PTIADL_PTIADL0_MASK             1U
#define PTIADL_PTIADL1_MASK             2U
#define PTIADL_PTIADL2_MASK             4U
#define PTIADL_PTIADL3_MASK             8U
#define PTIADL_PTIADL4_MASK             16U
#define PTIADL_PTIADL5_MASK             32U
#define PTIADL_PTIADL6_MASK             64U
#define PTIADL_PTIADL7_MASK             128U


/*** DDRADL - Port ADL Data Direction Register; 0x00000285 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRADL0     :1;                                       /* Port ADL data direction select 0 */
    byte DDRADL1     :1;                                       /* Port ADL data direction select 1 */
    byte DDRADL2     :1;                                       /* Port ADL data direction select 2 */
    byte DDRADL3     :1;                                       /* Port ADL data direction select 3 */
    byte DDRADL4     :1;                                       /* Port ADL data direction select 4 */
    byte DDRADL5     :1;                                       /* Port ADL data direction select 5 */
    byte DDRADL6     :1;                                       /* Port ADL data direction select 6 */
    byte DDRADL7     :1;                                       /* Port ADL data direction select 7 */
  } Bits;
} DDRADLSTR;
extern volatile DDRADLSTR _DDRADL @0x00000285;
#define DDRADL                          _DDRADL.Byte
#define DDRADL_DDRADL0                  _DDRADL.Bits.DDRADL0
#define DDRADL_DDRADL1                  _DDRADL.Bits.DDRADL1
#define DDRADL_DDRADL2                  _DDRADL.Bits.DDRADL2
#define DDRADL_DDRADL3                  _DDRADL.Bits.DDRADL3
#define DDRADL_DDRADL4                  _DDRADL.Bits.DDRADL4
#define DDRADL_DDRADL5                  _DDRADL.Bits.DDRADL5
#define DDRADL_DDRADL6                  _DDRADL.Bits.DDRADL6
#define DDRADL_DDRADL7                  _DDRADL.Bits.DDRADL7

#define DDRADL_DDRADL0_MASK             1U
#define DDRADL_DDRADL1_MASK             2U
#define DDRADL_DDRADL2_MASK             4U
#define DDRADL_DDRADL3_MASK             8U
#define DDRADL_DDRADL4_MASK             16U
#define DDRADL_DDRADL5_MASK             32U
#define DDRADL_DDRADL6_MASK             64U
#define DDRADL_DDRADL7_MASK             128U


/*** PERADL - Port ADL Pull Device Enable Register; 0x00000287 ***/
typedef union {
  byte Byte;
  struct {
    byte PERADL0     :1;                                       /* Port ADL pull device enable 0 */
    byte PERADL1     :1;                                       /* Port ADL pull device enable 1 */
    byte PERADL2     :1;                                       /* Port ADL pull device enable 2 */
    byte PERADL3     :1;                                       /* Port ADL pull device enable 3 */
    byte PERADL4     :1;                                       /* Port ADL pull device enable 4 */
    byte PERADL5     :1;                                       /* Port ADL pull device enable 5 */
    byte PERADL6     :1;                                       /* Port ADL pull device enable 6 */
    byte PERADL7     :1;                                       /* Port ADL pull device enable 7 */
  } Bits;
} PERADLSTR;
extern volatile PERADLSTR _PERADL @0x00000287;
#define PERADL                          _PERADL.Byte
#define PERADL_PERADL0                  _PERADL.Bits.PERADL0
#define PERADL_PERADL1                  _PERADL.Bits.PERADL1
#define PERADL_PERADL2                  _PERADL.Bits.PERADL2
#define PERADL_PERADL3                  _PERADL.Bits.PERADL3
#define PERADL_PERADL4                  _PERADL.Bits.PERADL4
#define PERADL_PERADL5                  _PERADL.Bits.PERADL5
#define PERADL_PERADL6                  _PERADL.Bits.PERADL6
#define PERADL_PERADL7                  _PERADL.Bits.PERADL7

#define PERADL_PERADL0_MASK             1U
#define PERADL_PERADL1_MASK             2U
#define PERADL_PERADL2_MASK             4U
#define PERADL_PERADL3_MASK             8U
#define PERADL_PERADL4_MASK             16U
#define PERADL_PERADL5_MASK             32U
#define PERADL_PERADL6_MASK             64U
#define PERADL_PERADL7_MASK             128U


/*** PPSADL - Port ADL Polarity Select Register; 0x00000289 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSADL0     :1;                                       /* Port ADL pull polarity select 0 */
    byte PPSADL1     :1;                                       /* Port ADL pull polarity select 1 */
    byte PPSADL2     :1;                                       /* Port ADL pull polarity select 2 */
    byte PPSADL3     :1;                                       /* Port ADL pull polarity select 3 */
    byte PPSADL4     :1;                                       /* Port ADL pull polarity select 4 */
    byte PPSADL5     :1;                                       /* Port ADL pull polarity select 5 */
    byte PPSADL6     :1;                                       /* Port ADL pull polarity select 6 */
    byte PPSADL7     :1;                                       /* Port ADL pull polarity select 7 */
  } Bits;
} PPSADLSTR;
extern volatile PPSADLSTR _PPSADL @0x00000289;
#define PPSADL                          _PPSADL.Byte
#define PPSADL_PPSADL0                  _PPSADL.Bits.PPSADL0
#define PPSADL_PPSADL1                  _PPSADL.Bits.PPSADL1
#define PPSADL_PPSADL2                  _PPSADL.Bits.PPSADL2
#define PPSADL_PPSADL3                  _PPSADL.Bits.PPSADL3
#define PPSADL_PPSADL4                  _PPSADL.Bits.PPSADL4
#define PPSADL_PPSADL5                  _PPSADL.Bits.PPSADL5
#define PPSADL_PPSADL6                  _PPSADL.Bits.PPSADL6
#define PPSADL_PPSADL7                  _PPSADL.Bits.PPSADL7

#define PPSADL_PPSADL0_MASK             1U
#define PPSADL_PPSADL1_MASK             2U
#define PPSADL_PPSADL2_MASK             4U
#define PPSADL_PPSADL3_MASK             8U
#define PPSADL_PPSADL4_MASK             16U
#define PPSADL_PPSADL5_MASK             32U
#define PPSADL_PPSADL6_MASK             64U
#define PPSADL_PPSADL7_MASK             128U


/*** PIEADL - Port ADL Interrupt Enable Register; 0x0000028D ***/
typedef union {
  byte Byte;
  struct {
    byte PIEADL0     :1;                                       /* Port ADL interrupt enable 0 */
    byte PIEADL1     :1;                                       /* Port ADL interrupt enable 1 */
    byte PIEADL2     :1;                                       /* Port ADL interrupt enable 2 */
    byte PIEADL3     :1;                                       /* Port ADL interrupt enable 3 */
    byte PIEADL4     :1;                                       /* Port ADL interrupt enable 4 */
    byte PIEADL5     :1;                                       /* Port ADL interrupt enable 5 */
    byte PIEADL6     :1;                                       /* Port ADL interrupt enable 6 */
    byte PIEADL7     :1;                                       /* Port ADL interrupt enable 7 */
  } Bits;
} PIEADLSTR;
extern volatile PIEADLSTR _PIEADL @0x0000028D;
#define PIEADL                          _PIEADL.Byte
#define PIEADL_PIEADL0                  _PIEADL.Bits.PIEADL0
#define PIEADL_PIEADL1                  _PIEADL.Bits.PIEADL1
#define PIEADL_PIEADL2                  _PIEADL.Bits.PIEADL2
#define PIEADL_PIEADL3                  _PIEADL.Bits.PIEADL3
#define PIEADL_PIEADL4                  _PIEADL.Bits.PIEADL4
#define PIEADL_PIEADL5                  _PIEADL.Bits.PIEADL5
#define PIEADL_PIEADL6                  _PIEADL.Bits.PIEADL6
#define PIEADL_PIEADL7                  _PIEADL.Bits.PIEADL7

#define PIEADL_PIEADL0_MASK             1U
#define PIEADL_PIEADL1_MASK             2U
#define PIEADL_PIEADL2_MASK             4U
#define PIEADL_PIEADL3_MASK             8U
#define PIEADL_PIEADL4_MASK             16U
#define PIEADL_PIEADL5_MASK             32U
#define PIEADL_PIEADL6_MASK             64U
#define PIEADL_PIEADL7_MASK             128U


/*** PIFADL - Port ADL Interrupt Flag Register; 0x0000028F ***/
typedef union {
  byte Byte;
  struct {
    byte PIFADL0     :1;                                       /* Port ADL interrupt flag 0 */
    byte PIFADL1     :1;                                       /* Port ADL interrupt flag 1 */
    byte PIFADL2     :1;                                       /* Port ADL interrupt flag 2 */
    byte PIFADL3     :1;                                       /* Port ADL interrupt flag 3 */
    byte PIFADL4     :1;                                       /* Port ADL interrupt flag 4 */
    byte PIFADL5     :1;                                       /* Port ADL interrupt flag 5 */
    byte PIFADL6     :1;                                       /* Port ADL interrupt flag 6 */
    byte PIFADL7     :1;                                       /* Port ADL interrupt flag 7 */
  } Bits;
} PIFADLSTR;
