ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
#define PPSP_PPSP0_MASK                 1U
#define PPSP_PPSP1_MASK                 2U
#define PPSP_PPSP2_MASK                 4U
#define PPSP_PPSP3_MASK                 8U
#define PPSP_PPSP4_MASK                 16U
#define PPSP_PPSP5_MASK                 32U
#define PPSP_PPSP6_MASK                 64U
#define PPSP_PPSP7_MASK                 128U


/*** PTH - Port H Data Register; 0x00000300 ***/
typedef union {
  byte Byte;
  struct {
    byte PTH0        :1;                                       /* Port H general purpose I/O data 0 */
    byte PTH1        :1;                                       /* Port H general purpose I/O data 1 */
    byte PTH2        :1;                                       /* Port H general purpose I/O data 2 */
    byte PTH3        :1;                                       /* Port H general purpose I/O data 3 */
    byte PTH4        :1;                                       /* Port H general purpose I/O data 4 */
    byte PTH5        :1;                                       /* Port H general purpose I/O data 5 */
    byte PTH6        :1;                                       /* Port H general purpose I/O data 6 */
    byte PTH7        :1;                                       /* Port H general purpose I/O data 7 */
  } Bits;
} PTHSTR;
extern volatile PTHSTR _PTH @0x00000300;
#define PTH                             _PTH.Byte
#define PTH_PTH0                        _PTH.Bits.PTH0
#define PTH_PTH1                        _PTH.Bits.PTH1
#define PTH_PTH2                        _PTH.Bits.PTH2
#define PTH_PTH3                        _PTH.Bits.PTH3
#define PTH_PTH4                        _PTH.Bits.PTH4
#define PTH_PTH5                        _PTH.Bits.PTH5
#define PTH_PTH6                        _PTH.Bits.PTH6
#define PTH_PTH7                        _PTH.Bits.PTH7

#define PTH_PTH0_MASK                   1U
#define PTH_PTH1_MASK                   2U
#define PTH_PTH2_MASK                   4U
#define PTH_PTH3_MASK                   8U
#define PTH_PTH4_MASK                   16U
#define PTH_PTH5_MASK                   32U
#define PTH_PTH6_MASK                   64U
#define PTH_PTH7_MASK                   128U


/*** PTIH - Port H Input Register; 0x00000301 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIH0       :1;                                       /* Port H data input 0 */
    byte PTIH1       :1;                                       /* Port H data input 1 */
    byte PTIH2       :1;                                       /* Port H data input 2 */
    byte PTIH3       :1;                                       /* Port H data input 3 */
    byte PTIH4       :1;                                       /* Port H data input 4 */
    byte PTIH5       :1;                                       /* Port H data input 5 */
    byte PTIH6       :1;                                       /* Port H data input 6 */
    byte PTIH7       :1;                                       /* Port H data input 7 */
  } Bits;
} PTIHSTR;
extern volatile PTIHSTR _PTIH @0x00000301;
#define PTIH                            _PTIH.Byte
#define PTIH_PTIH0                      _PTIH.Bits.PTIH0
#define PTIH_PTIH1                      _PTIH.Bits.PTIH1
#define PTIH_PTIH2                      _PTIH.Bits.PTIH2
#define PTIH_PTIH3                      _PTIH.Bits.PTIH3
#define PTIH_PTIH4                      _PTIH.Bits.PTIH4
#define PTIH_PTIH5                      _PTIH.Bits.PTIH5
#define PTIH_PTIH6                      _PTIH.Bits.PTIH6
#define PTIH_PTIH7                      _PTIH.Bits.PTIH7

#define PTIH_PTIH0_MASK                 1U
#define PTIH_PTIH1_MASK                 2U
#define PTIH_PTIH2_MASK                 4U
#define PTIH_PTIH3_MASK                 8U
#define PTIH_PTIH4_MASK                 16U
#define PTIH_PTIH5_MASK                 32U
#define PTIH_PTIH6_MASK                 64U
#define PTIH_PTIH7_MASK                 128U


/*** DDRH - Port H Data Direction Register; 0x00000302 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRH0       :1;                                       /* Port H data direction select 0 */
    byte DDRH1       :1;                                       /* Port H data direction select 1 */
    byte DDRH2       :1;                                       /* Port H data direction select 2 */
    byte DDRH3       :1;                                       /* Port H data direction select 3 */
    byte DDRH4       :1;                                       /* Port H data direction select 4 */
    byte DDRH5       :1;                                       /* Port H data direction select 5 */
    byte DDRH6       :1;                                       /* Port H data direction select 6 */
    byte DDRH7       :1;                                       /* Port H data direction select 7 */
  } Bits;
} DDRHSTR;
extern volatile DDRHSTR _DDRH @0x00000302;
#define DDRH                            _DDRH.Byte
#define DDRH_DDRH0                      _DDRH.Bits.DDRH0
#define DDRH_DDRH1                      _DDRH.Bits.DDRH1
#define DDRH_DDRH2                      _DDRH.Bits.DDRH2
#define DDRH_DDRH3                      _DDRH.Bits.DDRH3
#define DDRH_DDRH4                      _DDRH.Bits.DDRH4
#define DDRH_DDRH5                      _DDRH.Bits.DDRH5
#define DDRH_DDRH6                      _DDRH.Bits.DDRH6
#define DDRH_DDRH7                      _DDRH.Bits.DDRH7

#define DDRH_DDRH0_MASK                 1U
#define DDRH_DDRH1_MASK                 2U
#define DDRH_DDRH2_MASK                 4U
#define DDRH_DDRH3_MASK                 8U
#define DDRH_DDRH4_MASK                 16U
#define DDRH_DDRH5_MASK                 32U
#define DDRH_DDRH6_MASK                 64U
#define DDRH_DDRH7_MASK                 128U


/*** PERH - Port H Pull Device Enable Register; 0x00000303 ***/
typedef union {
  byte Byte;
  struct {
    byte PERH0       :1;                                       /* Port H pull device enable 0 */
    byte PERH1       :1;                                       /* Port H pull device enable 1 */
    byte PERH2       :1;                                       /* Port H pull device enable 2 */
    byte PERH3       :1;                                       /* Port H pull device enable 3 */
    byte PERH4       :1;                                       /* Port H pull device enable 4 */
    byte PERH5       :1;                                       /* Port H pull device enable 5 */
    byte PERH6       :1;                                       /* Port H pull device enable 6 */
    byte PERH7       :1;                                       /* Port H pull device enable 7 */
  } Bits;
} PERHSTR;
extern volatile PERHSTR _PERH @0x00000303;
#define PERH                            _PERH.Byte
#define PERH_PERH0                      _PERH.Bits.PERH0
#define PERH_PERH1                      _PERH.Bits.PERH1
#define PERH_PERH2                      _PERH.Bits.PERH2
#define PERH_PERH3                      _PERH.Bits.PERH3
#define PERH_PERH4                      _PERH.Bits.PERH4
#define PERH_PERH5                      _PERH.Bits.PERH5
#define PERH_PERH6                      _PERH.Bits.PERH6
#define PERH_PERH7                      _PERH.Bits.PERH7

#define PERH_PERH0_MASK                 1U
#define PERH_PERH1_MASK                 2U
#define PERH_PERH2_MASK                 4U
#define PERH_PERH3_MASK                 8U
#define PERH_PERH4_MASK                 16U
#define PERH_PERH5_MASK                 32U
#define PERH_PERH6_MASK                 64U
#define PERH_PERH7_MASK                 128U


