ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
/*** PPSH - Port H Polarity Select Register; 0x00000304 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSH0       :1;                                       /* Port H pull polarity select 0 */
    byte PPSH1       :1;                                       /* Port H pull polarity select 1 */
    byte PPSH2       :1;                                       /* Port H pull polarity select 2 */
    byte PPSH3       :1;                                       /* Port H pull polarity select 3 */
    byte PPSH4       :1;                                       /* Port H pull polarity select 4 */
    byte PPSH5       :1;                                       /* Port H pull polarity select 5 */
    byte PPSH6       :1;                                       /* Port H pull polarity select 6 */
    byte PPSH7       :1;                                       /* Port H pull polarity select 7 */
  } Bits;
} PPSHSTR;
extern volatile PPSHSTR _PPSH @0x00000304;
#define PPSH                            _PPSH.Byte
#define PPSH_PPSH0                      _PPSH.Bits.PPSH0
#define PPSH_PPSH1                      _PPSH.Bits.PPSH1
#define PPSH_PPSH2                      _PPSH.Bits.PPSH2
#define PPSH_PPSH3                      _PPSH.Bits.PPSH3
#define PPSH_PPSH4                      _PPSH.Bits.PPSH4
#define PPSH_PPSH5                      _PPSH.Bits.PPSH5
#define PPSH_PPSH6                      _PPSH.Bits.PPSH6
#define PPSH_PPSH7                      _PPSH.Bits.PPSH7

#define PPSH_PPSH0_MASK                 1U
#define PPSH_PPSH1_MASK                 2U
#define PPSH_PPSH2_MASK                 4U
#define PPSH_PPSH3_MASK                 8U
#define PPSH_PPSH4_MASK                 16U
#define PPSH_PPSH5_MASK                 32U
#define PPSH_PPSH6_MASK                 64U
#define PPSH_PPSH7_MASK                 128U


/*** PTG - Port G Data Register; 0x00000320 ***/
typedef union {
  byte Byte;
  struct {
    byte PTG0        :1;                                       /* Port G general purpose I/O data 0 */
    byte PTG1        :1;                                       /* Port G general purpose I/O data 1 */
    byte PTG2        :1;                                       /* Port G general purpose I/O data 2 */
    byte PTG3        :1;                                       /* Port G general purpose I/O data 3 */
    byte PTG4        :1;                                       /* Port G general purpose I/O data 4 */
    byte PTG5        :1;                                       /* Port G general purpose I/O data 5 */
    byte PTG6        :1;                                       /* Port G general purpose I/O data 6 */
    byte PTG7        :1;                                       /* Port G general purpose I/O data 7 */
  } Bits;
} PTGSTR;
extern volatile PTGSTR _PTG @0x00000320;
#define PTG                             _PTG.Byte
#define PTG_PTG0                        _PTG.Bits.PTG0
#define PTG_PTG1                        _PTG.Bits.PTG1
#define PTG_PTG2                        _PTG.Bits.PTG2
#define PTG_PTG3                        _PTG.Bits.PTG3
#define PTG_PTG4                        _PTG.Bits.PTG4
#define PTG_PTG5                        _PTG.Bits.PTG5
#define PTG_PTG6                        _PTG.Bits.PTG6
#define PTG_PTG7                        _PTG.Bits.PTG7

#define PTG_PTG0_MASK                   1U
#define PTG_PTG1_MASK                   2U
#define PTG_PTG2_MASK                   4U
#define PTG_PTG3_MASK                   8U
#define PTG_PTG4_MASK                   16U
#define PTG_PTG5_MASK                   32U
#define PTG_PTG6_MASK                   64U
#define PTG_PTG7_MASK                   128U


/*** PTIG - Port G Input Register; 0x00000321 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIG0       :1;                                       /* Port G data input 0 */
    byte PTIG1       :1;                                       /* Port G data input 1 */
    byte PTIG2       :1;                                       /* Port G data input 2 */
    byte PTIG3       :1;                                       /* Port G data input 3 */
    byte PTIG4       :1;                                       /* Port G data input 4 */
    byte PTIG5       :1;                                       /* Port G data input 5 */
    byte PTIG6       :1;                                       /* Port G data input 6 */
    byte PTIG7       :1;                                       /* Port G data input 7 */
  } Bits;
} PTIGSTR;
extern volatile PTIGSTR _PTIG @0x00000321;
#define PTIG                            _PTIG.Byte
#define PTIG_PTIG0                      _PTIG.Bits.PTIG0
#define PTIG_PTIG1                      _PTIG.Bits.PTIG1
#define PTIG_PTIG2                      _PTIG.Bits.PTIG2
#define PTIG_PTIG3                      _PTIG.Bits.PTIG3
#define PTIG_PTIG4                      _PTIG.Bits.PTIG4
#define PTIG_PTIG5                      _PTIG.Bits.PTIG5
#define PTIG_PTIG6                      _PTIG.Bits.PTIG6
#define PTIG_PTIG7                      _PTIG.Bits.PTIG7

#define PTIG_PTIG0_MASK                 1U
#define PTIG_PTIG1_MASK                 2U
#define PTIG_PTIG2_MASK                 4U
#define PTIG_PTIG3_MASK                 8U
#define PTIG_PTIG4_MASK                 16U
#define PTIG_PTIG5_MASK                 32U
#define PTIG_PTIG6_MASK                 64U
#define PTIG_PTIG7_MASK                 128U


/*** DDRG - Port G Data Direction Register; 0x00000322 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRG0       :1;                                       /* Port G data direction select 0 */
    byte DDRG1       :1;                                       /* Port G data direction select 1 */
    byte DDRG2       :1;                                       /* Port G data direction select 2 */
    byte DDRG3       :1;                                       /* Port G data direction select 3 */
    byte DDRG4       :1;                                       /* Port G data direction select 4 */
    byte DDRG5       :1;                                       /* Port G data direction select 5 */
    byte DDRG6       :1;                                       /* Port G data direction select 6 */
    byte DDRG7       :1;                                       /* Port G data direction select 7 */
  } Bits;
} DDRGSTR;
