ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
extern volatile DDRGSTR _DDRG @0x00000322;
#define DDRG                            _DDRG.Byte
#define DDRG_DDRG0                      _DDRG.Bits.DDRG0
#define DDRG_DDRG1                      _DDRG.Bits.DDRG1
#define DDRG_DDRG2                      _DDRG.Bits.DDRG2
#define DDRG_DDRG3                      _DDRG.Bits.DDRG3
#define DDRG_DDRG4                      _DDRG.Bits.DDRG4
#define DDRG_DDRG5                      _DDRG.Bits.DDRG5
#define DDRG_DDRG6                      _DDRG.Bits.DDRG6
#define DDRG_DDRG7                      _DDRG.Bits.DDRG7

#define DDRG_DDRG0_MASK                 1U
#define DDRG_DDRG1_MASK                 2U
#define DDRG_DDRG2_MASK                 4U
#define DDRG_DDRG3_MASK                 8U
#define DDRG_DDRG4_MASK                 16U
#define DDRG_DDRG5_MASK                 32U
#define DDRG_DDRG6_MASK                 64U
#define DDRG_DDRG7_MASK                 128U


/*** PERG - Port G Pull Device Enable Register; 0x00000323 ***/
typedef union {
  byte Byte;
  struct {
    byte PERG0       :1;                                       /* Port G pull device enable 0 */
    byte PERG1       :1;                                       /* Port G pull device enable 1 */
    byte PERG2       :1;                                       /* Port G pull device enable 2 */
    byte PERG3       :1;                                       /* Port G pull device enable 3 */
    byte PERG4       :1;                                       /* Port G pull device enable 4 */
    byte PERG5       :1;                                       /* Port G pull device enable 5 */
    byte PERG6       :1;                                       /* Port G pull device enable 6 */
    byte PERG7       :1;                                       /* Port G pull device enable 7 */
  } Bits;
} PERGSTR;
extern volatile PERGSTR _PERG @0x00000323;
#define PERG                            _PERG.Byte
#define PERG_PERG0                      _PERG.Bits.PERG0
#define PERG_PERG1                      _PERG.Bits.PERG1
#define PERG_PERG2                      _PERG.Bits.PERG2
#define PERG_PERG3                      _PERG.Bits.PERG3
#define PERG_PERG4                      _PERG.Bits.PERG4
#define PERG_PERG5                      _PERG.Bits.PERG5
#define PERG_PERG6                      _PERG.Bits.PERG6
#define PERG_PERG7                      _PERG.Bits.PERG7

#define PERG_PERG0_MASK                 1U
#define PERG_PERG1_MASK                 2U
#define PERG_PERG2_MASK                 4U
#define PERG_PERG3_MASK                 8U
#define PERG_PERG4_MASK                 16U
#define PERG_PERG5_MASK                 32U
#define PERG_PERG6_MASK                 64U
#define PERG_PERG7_MASK                 128U


/*** PPSG - Port G Polarity Select Register; 0x00000324 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSG0       :1;                                       /* Port G pull polarity select 0 */
    byte PPSG1       :1;                                       /* Port G pull polarity select 1 */
    byte PPSG2       :1;                                       /* Port G pull polarity select 2 */
    byte PPSG3       :1;                                       /* Port G pull polarity select 3 */
    byte PPSG4       :1;                                       /* Port G pull polarity select 4 */
    byte PPSG5       :1;                                       /* Port G pull polarity select 5 */
    byte PPSG6       :1;                                       /* Port G pull polarity select 6 */
    byte PPSG7       :1;                                       /* Port G pull polarity select 7 */
  } Bits;
} PPSGSTR;
extern volatile PPSGSTR _PPSG @0x00000324;
#define PPSG                            _PPSG.Byte
#define PPSG_PPSG0                      _PPSG.Bits.PPSG0
#define PPSG_PPSG1                      _PPSG.Bits.PPSG1
#define PPSG_PPSG2                      _PPSG.Bits.PPSG2
#define PPSG_PPSG3                      _PPSG.Bits.PPSG3
#define PPSG_PPSG4                      _PPSG.Bits.PPSG4
#define PPSG_PPSG5                      _PPSG.Bits.PPSG5
#define PPSG_PPSG6                      _PPSG.Bits.PPSG6
#define PPSG_PPSG7                      _PPSG.Bits.PPSG7

#define PPSG_PPSG0_MASK                 1U
#define PPSG_PPSG1_MASK                 2U
#define PPSG_PPSG2_MASK                 4U
#define PPSG_PPSG3_MASK                 8U
#define PPSG_PPSG4_MASK                 16U
#define PPSG_PPSG5_MASK                 32U
#define PPSG_PPSG6_MASK                 64U
#define PPSG_PPSG7_MASK                 128U


/*** PTU - Port U Data Register; 0x00000350 ***/
typedef union {
  byte Byte;
  struct {
    byte PTU0        :1;                                       /* Port U general purpose I/O data 0 */
    byte PTU1        :1;                                       /* Port U general purpose I/O data 1 */
    byte PTU2        :1;                                       /* Port U general purpose I/O data 2 */
    byte PTU3        :1;                                       /* Port U general purpose I/O data 3 */
    byte PTU4        :1;                                       /* Port U general purpose I/O data 4 */
    byte PTU5        :1;                                       /* Port U general purpose I/O data 5 */
    byte PTU6        :1;                                       /* Port U general purpose I/O data 6 */
    byte PTU7        :1;                                       /* Port U general purpose I/O data 7 */
  } Bits;
} PTUSTR;
extern volatile PTUSTR _PTU @0x00000350;
#define PTU                             _PTU.Byte
#define PTU_PTU0                        _PTU.Bits.PTU0
#define PTU_PTU1                        _PTU.Bits.PTU1
#define PTU_PTU2                        _PTU.Bits.PTU2
#define PTU_PTU3                        _PTU.Bits.PTU3
#define PTU_PTU4                        _PTU.Bits.PTU4
#define PTU_PTU5                        _PTU.Bits.PTU5
#define PTU_PTU6                        _PTU.Bits.PTU6
#define PTU_PTU7                        _PTU.Bits.PTU7

#define PTU_PTU0_MASK                   1U
#define PTU_PTU1_MASK                   2U
#define PTU_PTU2_MASK                   4U
#define PTU_PTU3_MASK                   8U
#define PTU_PTU4_MASK                   16U
#define PTU_PTU5_MASK                   32U
#define PTU_PTU6_MASK                   64U
#define PTU_PTU7_MASK                   128U


/*** PTIU - Port U Input Register; 0x00000351 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIU0       :1;                                       /* Port U data input 0 */
    byte PTIU1       :1;                                       /* Port U data input 1 */
    byte PTIU2       :1;                                       /* Port U data input 2 */
    byte PTIU3       :1;                                       /* Port U data input 3 */
    byte PTIU4       :1;                                       /* Port U data input 4 */
    byte PTIU5       :1;                                       /* Port U data input 5 */
    byte PTIU6       :1;                                       /* Port U data input 6 */
    byte PTIU7       :1;                                       /* Port U data input 7 */
  } Bits;
} PTIUSTR;
