ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
extern volatile PTIUSTR _PTIU @0x00000351;
#define PTIU                            _PTIU.Byte
#define PTIU_PTIU0                      _PTIU.Bits.PTIU0
#define PTIU_PTIU1                      _PTIU.Bits.PTIU1
#define PTIU_PTIU2                      _PTIU.Bits.PTIU2
#define PTIU_PTIU3                      _PTIU.Bits.PTIU3
#define PTIU_PTIU4                      _PTIU.Bits.PTIU4
#define PTIU_PTIU5                      _PTIU.Bits.PTIU5
#define PTIU_PTIU6                      _PTIU.Bits.PTIU6
#define PTIU_PTIU7                      _PTIU.Bits.PTIU7

#define PTIU_PTIU0_MASK                 1U
#define PTIU_PTIU1_MASK                 2U
#define PTIU_PTIU2_MASK                 4U
#define PTIU_PTIU3_MASK                 8U
#define PTIU_PTIU4_MASK                 16U
#define PTIU_PTIU5_MASK                 32U
#define PTIU_PTIU6_MASK                 64U
#define PTIU_PTIU7_MASK                 128U


/*** DDRU - Port U Data Direction Register; 0x00000352 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRU0       :1;                                       /* Port U data direction select 0 */
    byte DDRU1       :1;                                       /* Port U data direction select 1 */
    byte DDRU2       :1;                                       /* Port U data direction select 2 */
    byte DDRU3       :1;                                       /* Port U data direction select 3 */
    byte DDRU4       :1;                                       /* Port U data direction select 4 */
    byte DDRU5       :1;                                       /* Port U data direction select 5 */
    byte DDRU6       :1;                                       /* Port U data direction select 6 */
    byte DDRU7       :1;                                       /* Port U data direction select 7 */
  } Bits;
} DDRUSTR;
extern volatile DDRUSTR _DDRU @0x00000352;
#define DDRU                            _DDRU.Byte
#define DDRU_DDRU0                      _DDRU.Bits.DDRU0
#define DDRU_DDRU1                      _DDRU.Bits.DDRU1
#define DDRU_DDRU2                      _DDRU.Bits.DDRU2
#define DDRU_DDRU3                      _DDRU.Bits.DDRU3
#define DDRU_DDRU4                      _DDRU.Bits.DDRU4
#define DDRU_DDRU5                      _DDRU.Bits.DDRU5
#define DDRU_DDRU6                      _DDRU.Bits.DDRU6
#define DDRU_DDRU7                      _DDRU.Bits.DDRU7

#define DDRU_DDRU0_MASK                 1U
#define DDRU_DDRU1_MASK                 2U
#define DDRU_DDRU2_MASK                 4U
#define DDRU_DDRU3_MASK                 8U
#define DDRU_DDRU4_MASK                 16U
#define DDRU_DDRU5_MASK                 32U
#define DDRU_DDRU6_MASK                 64U
#define DDRU_DDRU7_MASK                 128U


/*** PERU - Port U Pull Device Enable Register; 0x00000353 ***/
typedef union {
  byte Byte;
  struct {
    byte PERU0       :1;                                       /* Port U pull device enable 0 */
    byte PERU1       :1;                                       /* Port U pull device enable 1 */
    byte PERU2       :1;                                       /* Port U pull device enable 2 */
    byte PERU3       :1;                                       /* Port U pull device enable 3 */
    byte PERU4       :1;                                       /* Port U pull device enable 4 */
    byte PERU5       :1;                                       /* Port U pull device enable 5 */
    byte PERU6       :1;                                       /* Port U pull device enable 6 */
    byte PERU7       :1;                                       /* Port U pull device enable 7 */
  } Bits;
} PERUSTR;
extern volatile PERUSTR _PERU @0x00000353;
#define PERU                            _PERU.Byte
#define PERU_PERU0                      _PERU.Bits.PERU0
#define PERU_PERU1                      _PERU.Bits.PERU1
#define PERU_PERU2                      _PERU.Bits.PERU2
#define PERU_PERU3                      _PERU.Bits.PERU3
#define PERU_PERU4                      _PERU.Bits.PERU4
#define PERU_PERU5                      _PERU.Bits.PERU5
#define PERU_PERU6                      _PERU.Bits.PERU6
#define PERU_PERU7                      _PERU.Bits.PERU7

#define PERU_PERU0_MASK                 1U
#define PERU_PERU1_MASK                 2U
#define PERU_PERU2_MASK                 4U
#define PERU_PERU3_MASK                 8U
#define PERU_PERU4_MASK                 16U
#define PERU_PERU5_MASK                 32U
#define PERU_PERU6_MASK                 64U
#define PERU_PERU7_MASK                 128U


/*** PPSU - Port U Polarity Select Register; 0x00000354 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSU0       :1;                                       /* Port U pull polarity select 0 */
    byte PPSU1       :1;                                       /* Port U pull polarity select 1 */
    byte PPSU2       :1;                                       /* Port U pull polarity select 2 */
    byte PPSU3       :1;                                       /* Port U pull polarity select 3 */
    byte PPSU4       :1;                                       /* Port U pull polarity select 4 */
    byte PPSU5       :1;                                       /* Port U pull polarity select 5 */
    byte PPSU6       :1;                                       /* Port U pull polarity select 6 */
    byte PPSU7       :1;                                       /* Port U pull polarity select 7 */
  } Bits;
} PPSUSTR;
extern volatile PPSUSTR _PPSU @0x00000354;
#define PPSU                            _PPSU.Byte
#define PPSU_PPSU0                      _PPSU.Bits.PPSU0
#define PPSU_PPSU1                      _PPSU.Bits.PPSU1
#define PPSU_PPSU2                      _PPSU.Bits.PPSU2
#define PPSU_PPSU3                      _PPSU.Bits.PPSU3
#define PPSU_PPSU4                      _PPSU.Bits.PPSU4
#define PPSU_PPSU5                      _PPSU.Bits.PPSU5
#define PPSU_PPSU6                      _PPSU.Bits.PPSU6
#define PPSU_PPSU7                      _PPSU.Bits.PPSU7

#define PPSU_PPSU0_MASK                 1U
#define PPSU_PPSU1_MASK                 2U
#define PPSU_PPSU2_MASK                 4U
#define PPSU_PPSU3_MASK                 8U
#define PPSU_PPSU4_MASK                 16U
#define PPSU_PPSU5_MASK                 32U
#define PPSU_PPSU6_MASK                 64U
#define PPSU_PPSU7_MASK                 128U


/*** SRRU - Port U Slew Rate Register; 0x0000035E ***/
typedef union {
  byte Byte;
  struct {
    byte SRRU0       :1;                                       /* Slew rate port U control 0 */
    byte SRRU1       :1;                                       /* Slew rate port U control 1 */
    byte SRRU2       :1;                                       /* Slew rate port U control 2 */
    byte SRRU3       :1;                                       /* Slew rate port U control 3 */
    byte SRRU4       :1;                                       /* Slew rate port U control 4 */
    byte SRRU5       :1;                                       /* Slew rate port U control 5 */
    byte SRRU6       :1;                                       /* Slew rate port U control 6 */
    byte SRRU7       :1;                                       /* Slew rate port U control 7 */
  } Bits;
} SRRUSTR;
extern volatile SRRUSTR _SRRU @0x0000035E;
#define SRRU                            _SRRU.Byte
#define SRRU_SRRU0                      _SRRU.Bits.SRRU0
#define SRRU_SRRU1                      _SRRU.Bits.SRRU1
#define SRRU_SRRU2                      _SRRU.Bits.SRRU2
#define SRRU_SRRU3                      _SRRU.Bits.SRRU3
#define SRRU_SRRU4                      _SRRU.Bits.SRRU4
#define SRRU_SRRU5                      _SRRU.Bits.SRRU5
#define SRRU_SRRU6                      _SRRU.Bits.SRRU6
#define SRRU_SRRU7                      _SRRU.Bits.SRRU7

#define SRRU_SRRU0_MASK                 1U
#define SRRU_SRRU1_MASK                 2U
#define SRRU_SRRU2_MASK                 4U
#define SRRU_SRRU3_MASK                 8U
#define SRRU_SRRU4_MASK                 16U
#define SRRU_SRRU5_MASK                 32U
#define SRRU_SRRU6_MASK                 64U
#define SRRU_SRRU7_MASK                 128U


/*** PTV - Port V Data Register; 0x00000360 ***/
typedef union {
  byte Byte;
  struct {
    byte PTV0        :1;                                       /* Port V general purpose I/O data 0 */
    byte PTV1        :1;                                       /* Port V general purpose I/O data 1 */
    byte PTV2        :1;                                       /* Port V general purpose I/O data 2 */
    byte PTV3        :1;                                       /* Port V general purpose I/O data 3 */
    byte PTV4        :1;                                       /* Port V general purpose I/O data 4 */
    byte PTV5        :1;                                       /* Port V general purpose I/O data 5 */
    byte PTV6        :1;                                       /* Port V general purpose I/O data 6 */
    byte PTV7        :1;                                       /* Port V general purpose I/O data 7 */
  } Bits;
} PTVSTR;
