ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
extern volatile PTVSTR _PTV @0x00000360;
#define PTV                             _PTV.Byte
#define PTV_PTV0                        _PTV.Bits.PTV0
#define PTV_PTV1                        _PTV.Bits.PTV1
#define PTV_PTV2                        _PTV.Bits.PTV2
#define PTV_PTV3                        _PTV.Bits.PTV3
#define PTV_PTV4                        _PTV.Bits.PTV4
#define PTV_PTV5                        _PTV.Bits.PTV5
#define PTV_PTV6                        _PTV.Bits.PTV6
#define PTV_PTV7                        _PTV.Bits.PTV7

#define PTV_PTV0_MASK                   1U
#define PTV_PTV1_MASK                   2U
#define PTV_PTV2_MASK                   4U
#define PTV_PTV3_MASK                   8U
#define PTV_PTV4_MASK                   16U
#define PTV_PTV5_MASK                   32U
#define PTV_PTV6_MASK                   64U
#define PTV_PTV7_MASK                   128U


/*** PTIV - Port V Input Register; 0x00000361 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIV0       :1;                                       /* Port V data input 0 */
    byte PTIV1       :1;                                       /* Port V data input 1 */
    byte PTIV2       :1;                                       /* Port V data input 2 */
    byte PTIV3       :1;                                       /* Port V data input 3 */
    byte PTIV4       :1;                                       /* Port V data input 4 */
    byte PTIV5       :1;                                       /* Port V data input 5 */
    byte PTIV6       :1;                                       /* Port V data input 6 */
    byte PTIV7       :1;                                       /* Port V data input 7 */
  } Bits;
} PTIVSTR;
extern volatile PTIVSTR _PTIV @0x00000361;
#define PTIV                            _PTIV.Byte
#define PTIV_PTIV0                      _PTIV.Bits.PTIV0
#define PTIV_PTIV1                      _PTIV.Bits.PTIV1
#define PTIV_PTIV2                      _PTIV.Bits.PTIV2
#define PTIV_PTIV3                      _PTIV.Bits.PTIV3
#define PTIV_PTIV4                      _PTIV.Bits.PTIV4
#define PTIV_PTIV5                      _PTIV.Bits.PTIV5
#define PTIV_PTIV6                      _PTIV.Bits.PTIV6
#define PTIV_PTIV7                      _PTIV.Bits.PTIV7

#define PTIV_PTIV0_MASK                 1U
#define PTIV_PTIV1_MASK                 2U
#define PTIV_PTIV2_MASK                 4U
#define PTIV_PTIV3_MASK                 8U
#define PTIV_PTIV4_MASK                 16U
#define PTIV_PTIV5_MASK                 32U
#define PTIV_PTIV6_MASK                 64U
#define PTIV_PTIV7_MASK                 128U


/*** DDRV - Port V Data Direction Register; 0x00000362 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRV0       :1;                                       /* Port V data direction select 0 */
    byte DDRV1       :1;                                       /* Port V data direction select 1 */
    byte DDRV2       :1;                                       /* Port V data direction select 2 */
    byte DDRV3       :1;                                       /* Port V data direction select 3 */
    byte DDRV4       :1;                                       /* Port V data direction select 4 */
    byte DDRV5       :1;                                       /* Port V data direction select 5 */
    byte DDRV6       :1;                                       /* Port V data direction select 6 */
    byte DDRV7       :1;                                       /* Port V data direction select 7 */
  } Bits;
} DDRVSTR;
extern volatile DDRVSTR _DDRV @0x00000362;
#define DDRV                            _DDRV.Byte
#define DDRV_DDRV0                      _DDRV.Bits.DDRV0
#define DDRV_DDRV1                      _DDRV.Bits.DDRV1
#define DDRV_DDRV2                      _DDRV.Bits.DDRV2
#define DDRV_DDRV3                      _DDRV.Bits.DDRV3
#define DDRV_DDRV4                      _DDRV.Bits.DDRV4
#define DDRV_DDRV5                      _DDRV.Bits.DDRV5
#define DDRV_DDRV6                      _DDRV.Bits.DDRV6
#define DDRV_DDRV7                      _DDRV.Bits.DDRV7

#define DDRV_DDRV0_MASK                 1U
#define DDRV_DDRV1_MASK                 2U
#define DDRV_DDRV2_MASK                 4U
#define DDRV_DDRV3_MASK                 8U
#define DDRV_DDRV4_MASK                 16U
#define DDRV_DDRV5_MASK                 32U
#define DDRV_DDRV6_MASK                 64U
#define DDRV_DDRV7_MASK                 128U


/*** PERV - Port V Pull Device Enable Register; 0x00000363 ***/
typedef union {
  byte Byte;
  struct {
    byte PERV0       :1;                                       /* Port V pull device enable 0 */
    byte PERV1       :1;                                       /* Port V pull device enable 1 */
    byte PERV2       :1;                                       /* Port V pull device enable 2 */
    byte PERV3       :1;                                       /* Port V pull device enable 3 */
    byte PERV4       :1;                                       /* Port V pull device enable 4 */
    byte PERV5       :1;                                       /* Port V pull device enable 5 */
    byte PERV6       :1;                                       /* Port V pull device enable 6 */
    byte PERV7       :1;                                       /* Port V pull device enable 7 */
  } Bits;
} PERVSTR;
extern volatile PERVSTR _PERV @0x00000363;
#define PERV                            _PERV.Byte
#define PERV_PERV0                      _PERV.Bits.PERV0
#define PERV_PERV1                      _PERV.Bits.PERV1
#define PERV_PERV2                      _PERV.Bits.PERV2
#define PERV_PERV3                      _PERV.Bits.PERV3
#define PERV_PERV4                      _PERV.Bits.PERV4
#define PERV_PERV5                      _PERV.Bits.PERV5
#define PERV_PERV6                      _PERV.Bits.PERV6
#define PERV_PERV7                      _PERV.Bits.PERV7

#define PERV_PERV0_MASK                 1U
#define PERV_PERV1_MASK                 2U
#define PERV_PERV2_MASK                 4U
#define PERV_PERV3_MASK                 8U
#define PERV_PERV4_MASK                 16U
#define PERV_PERV5_MASK                 32U
#define PERV_PERV6_MASK                 64U
#define PERV_PERV7_MASK                 128U


