ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
/*** TIM1OC7M - Output Compare 7 Mask Register; 0x00000402 ***/
typedef union {
  byte Byte;
  struct {
    byte OC7M0       :1;                                       /* Output Compare 7 Mask Bit 0 */
    byte OC7M1       :1;                                       /* Output Compare 7 Mask Bit 1 */
    byte OC7M2       :1;                                       /* Output Compare 7 Mask Bit 2 */
    byte OC7M3       :1;                                       /* Output Compare 7 Mask Bit 3 */
    byte OC7M4       :1;                                       /* Output Compare 7 Mask Bit 4 */
    byte OC7M5       :1;                                       /* Output Compare 7 Mask Bit 5 */
    byte OC7M6       :1;                                       /* Output Compare 7 Mask Bit 6 */
    byte OC7M7       :1;                                       /* Output Compare 7 Mask Bit 7 */
  } Bits;
} TIM1OC7MSTR;
extern volatile TIM1OC7MSTR _TIM1OC7M @0x00000402;
#define TIM1OC7M                        _TIM1OC7M.Byte
#define TIM1OC7M_OC7M0                  _TIM1OC7M.Bits.OC7M0
#define TIM1OC7M_OC7M1                  _TIM1OC7M.Bits.OC7M1
#define TIM1OC7M_OC7M2                  _TIM1OC7M.Bits.OC7M2
#define TIM1OC7M_OC7M3                  _TIM1OC7M.Bits.OC7M3
#define TIM1OC7M_OC7M4                  _TIM1OC7M.Bits.OC7M4
#define TIM1OC7M_OC7M5                  _TIM1OC7M.Bits.OC7M5
#define TIM1OC7M_OC7M6                  _TIM1OC7M.Bits.OC7M6
#define TIM1OC7M_OC7M7                  _TIM1OC7M.Bits.OC7M7

#define TIM1OC7M_OC7M0_MASK             1U
#define TIM1OC7M_OC7M1_MASK             2U
#define TIM1OC7M_OC7M2_MASK             4U
#define TIM1OC7M_OC7M3_MASK             8U
#define TIM1OC7M_OC7M4_MASK             16U
#define TIM1OC7M_OC7M5_MASK             32U
#define TIM1OC7M_OC7M6_MASK             64U
#define TIM1OC7M_OC7M7_MASK             128U


/*** TIM1OC7D - Output Compare 7 Data Register; 0x00000403 ***/
typedef union {
  byte Byte;
  struct {
    byte OC7D0       :1;                                       /* Output Compare 7 Bit 0 */
    byte OC7D1       :1;                                       /* Output Compare 7 Bit 1 */
    byte OC7D2       :1;                                       /* Output Compare 7 Bit 2 */
    byte OC7D3       :1;                                       /* Output Compare 7 Bit 3 */
    byte OC7D4       :1;                                       /* Output Compare 7 Bit 4 */
    byte OC7D5       :1;                                       /* Output Compare 7 Bit 5 */
    byte OC7D6       :1;                                       /* Output Compare 7 Bit 6 */
    byte OC7D7       :1;                                       /* Output Compare 7 Bit 7 */
  } Bits;
} TIM1OC7DSTR;
extern volatile TIM1OC7DSTR _TIM1OC7D @0x00000403;
#define TIM1OC7D                        _TIM1OC7D.Byte
#define TIM1OC7D_OC7D0                  _TIM1OC7D.Bits.OC7D0
#define TIM1OC7D_OC7D1                  _TIM1OC7D.Bits.OC7D1
#define TIM1OC7D_OC7D2                  _TIM1OC7D.Bits.OC7D2
#define TIM1OC7D_OC7D3                  _TIM1OC7D.Bits.OC7D3
#define TIM1OC7D_OC7D4                  _TIM1OC7D.Bits.OC7D4
#define TIM1OC7D_OC7D5                  _TIM1OC7D.Bits.OC7D5
#define TIM1OC7D_OC7D6                  _TIM1OC7D.Bits.OC7D6
#define TIM1OC7D_OC7D7                  _TIM1OC7D.Bits.OC7D7

#define TIM1OC7D_OC7D0_MASK             1U
#define TIM1OC7D_OC7D1_MASK             2U
#define TIM1OC7D_OC7D2_MASK             4U
#define TIM1OC7D_OC7D3_MASK             8U
#define TIM1OC7D_OC7D4_MASK             16U
#define TIM1OC7D_OC7D5_MASK             32U
#define TIM1OC7D_OC7D6_MASK             64U
#define TIM1OC7D_OC7D7_MASK             128U


/*** TIM1TCNT - Timer Count Register; 0x00000404 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM1TCNTHi - Timer Count Register High (OBSOLETE - defined for backward compatibility); 0x00000404 ***/
    union {
      byte Byte;
      /*** TIM1TCNTHi - Timer Count Register High (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TCNTHi                _TIM1TCNT.Overlap_STR.TIM1TCNTHiSTR.Byte
      
      /*** TIM1TCNTH - Timer Count Register High; Several registers at the same address ***/
      #define TIM1TCNTH                 _TIM1TCNT.Overlap_STR.TIM1TCNTHiSTR.Byte
      
    } TIM1TCNTHiSTR;
    

    /*** TIM1TCNTLo - Timer Count Register Low (OBSOLETE - defined for backward compatibility); 0x00000405 ***/
    union {
      byte Byte;
      /*** TIM1TCNTLo - Timer Count Register Low (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TCNTLo                _TIM1TCNT.Overlap_STR.TIM1TCNTLoSTR.Byte
      
      /*** TIM1TCNTL - Timer Count Register Low; Several registers at the same address ***/
      #define TIM1TCNTL                 _TIM1TCNT.Overlap_STR.TIM1TCNTLoSTR.Byte
      
    } TIM1TCNTLoSTR;
    
  } Overlap_STR;

} TIM1TCNTSTR;
extern volatile TIM1TCNTSTR _TIM1TCNT @0x00000404;
#define TIM1TCNT                        _TIM1TCNT.Word


/*** TIM1TSCR1 - Timer System Control Register1; 0x00000406 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PRNT        :1;                                       /* Precision Timer */
    byte TFFCA       :1;                                       /* Timer Fast Flag Clear All */
    byte TSFRZ       :1;                                       /* Timer and Modulus Counter Stop While in Freeze Mode */
    byte TSWAI       :1;                                       /* Timer Module Stops While in Wait */
    byte TEN         :1;                                       /* Timer Enable */
  } Bits;
} TIM1TSCR1STR;
extern volatile TIM1TSCR1STR _TIM1TSCR1 @0x00000406;
#define TIM1TSCR1                       _TIM1TSCR1.Byte
#define TIM1TSCR1_PRNT                  _TIM1TSCR1.Bits.PRNT
#define TIM1TSCR1_TFFCA                 _TIM1TSCR1.Bits.TFFCA
#define TIM1TSCR1_TSFRZ                 _TIM1TSCR1.Bits.TSFRZ
#define TIM1TSCR1_TSWAI                 _TIM1TSCR1.Bits.TSWAI
#define TIM1TSCR1_TEN                   _TIM1TSCR1.Bits.TEN

#define TIM1TSCR1_PRNT_MASK             8U
#define TIM1TSCR1_TFFCA_MASK            16U
#define TIM1TSCR1_TSFRZ_MASK            32U
#define TIM1TSCR1_TSWAI_MASK            64U
#define TIM1TSCR1_TEN_MASK              128U


/*** TIM1TTOV - Timer Toggle On Overflow Register; 0x00000407 ***/
typedef union {
  byte Byte;
  struct {
    byte TOV0        :1;                                       /* Toggle On Overflow Bit 0 */
    byte TOV1        :1;                                       /* Toggle On Overflow Bit 1 */
    byte TOV2        :1;                                       /* Toggle On Overflow Bit 2 */
    byte TOV3        :1;                                       /* Toggle On Overflow Bit 3 */
    byte TOV4        :1;                                       /* Toggle On Overflow Bit 4 */
    byte TOV5        :1;                                       /* Toggle On Overflow Bit 5 */
    byte TOV6        :1;                                       /* Toggle On Overflow Bit 6 */
    byte TOV7        :1;                                       /* Toggle On Overflow Bit 7 */
  } Bits;
} TIM1TTOVSTR;
extern volatile TIM1TTOVSTR _TIM1TTOV @0x00000407;
#define TIM1TTOV                        _TIM1TTOV.Byte
#define TIM1TTOV_TOV0                   _TIM1TTOV.Bits.TOV0
#define TIM1TTOV_TOV1                   _TIM1TTOV.Bits.TOV1
#define TIM1TTOV_TOV2                   _TIM1TTOV.Bits.TOV2
#define TIM1TTOV_TOV3                   _TIM1TTOV.Bits.TOV3
#define TIM1TTOV_TOV4                   _TIM1TTOV.Bits.TOV4
#define TIM1TTOV_TOV5                   _TIM1TTOV.Bits.TOV5
#define TIM1TTOV_TOV6                   _TIM1TTOV.Bits.TOV6
#define TIM1TTOV_TOV7                   _TIM1TTOV.Bits.TOV7

#define TIM1TTOV_TOV0_MASK              1U
#define TIM1TTOV_TOV1_MASK              2U
#define TIM1TTOV_TOV2_MASK              4U
#define TIM1TTOV_TOV3_MASK              8U
#define TIM1TTOV_TOV4_MASK              16U
#define TIM1TTOV_TOV5_MASK              32U
#define TIM1TTOV_TOV6_MASK              64U
#define TIM1TTOV_TOV7_MASK              128U


