ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
#define LCDFPENR0_FP0EN_MASK            1U
#define LCDFPENR0_FP1EN_MASK            2U
#define LCDFPENR0_FP2EN_MASK            4U
#define LCDFPENR0_FP3EN_MASK            8U
#define LCDFPENR0_FP4EN_MASK            16U
#define LCDFPENR0_FP5EN_MASK            32U
#define LCDFPENR0_FP6EN_MASK            64U
#define LCDFPENR0_FP7EN_MASK            128U


/*** LCDFPENR1 - LCD Frontplane Enable Register 1; 0x00000A03 ***/
typedef union {
  byte Byte;
  struct {
    byte FP8EN       :1;                                       /* Frontplane Output Enable Bit 8 */
    byte FP9EN       :1;                                       /* Frontplane Output Enable Bit 9 */
    byte FP10EN      :1;                                       /* Frontplane Output Enable Bit 10 */
    byte FP11EN      :1;                                       /* Frontplane Output Enable Bit 11 */
    byte FP12EN      :1;                                       /* Frontplane Output Enable Bit 12 */
    byte FP13EN      :1;                                       /* Frontplane Output Enable Bit 13 */
    byte FP14EN      :1;                                       /* Frontplane Output Enable Bit 14 */
    byte FP15EN      :1;                                       /* Frontplane Output Enable Bit 15 */
  } Bits;
} LCDFPENR1STR;
extern volatile LCDFPENR1STR _LCDFPENR1 @0x00000A03;
#define LCDFPENR1                       _LCDFPENR1.Byte
#define LCDFPENR1_FP8EN                 _LCDFPENR1.Bits.FP8EN
#define LCDFPENR1_FP9EN                 _LCDFPENR1.Bits.FP9EN
#define LCDFPENR1_FP10EN                _LCDFPENR1.Bits.FP10EN
#define LCDFPENR1_FP11EN                _LCDFPENR1.Bits.FP11EN
#define LCDFPENR1_FP12EN                _LCDFPENR1.Bits.FP12EN
#define LCDFPENR1_FP13EN                _LCDFPENR1.Bits.FP13EN
#define LCDFPENR1_FP14EN                _LCDFPENR1.Bits.FP14EN
#define LCDFPENR1_FP15EN                _LCDFPENR1.Bits.FP15EN

#define LCDFPENR1_FP8EN_MASK            1U
#define LCDFPENR1_FP9EN_MASK            2U
#define LCDFPENR1_FP10EN_MASK           4U
#define LCDFPENR1_FP11EN_MASK           8U
#define LCDFPENR1_FP12EN_MASK           16U
#define LCDFPENR1_FP13EN_MASK           32U
#define LCDFPENR1_FP14EN_MASK           64U
#define LCDFPENR1_FP15EN_MASK           128U


/*** LCDFPENR2 - LCD Frontplane Enable Register 2; 0x00000A04 ***/
typedef union {
  byte Byte;
  struct {
    byte FP16EN      :1;                                       /* Frontplane Output Enable Bit 16 */
    byte FP17EN      :1;                                       /* Frontplane Output Enable Bit 17 */
    byte FP18EN      :1;                                       /* Frontplane Output Enable Bit 18 */
    byte FP19EN      :1;                                       /* Frontplane Output Enable Bit 19 */
    byte FP20EN      :1;                                       /* Frontplane Output Enable Bit 20 */
    byte FP21EN      :1;                                       /* Frontplane Output Enable Bit 21 */
    byte FP22EN      :1;                                       /* Frontplane Output Enable Bit 22 */
    byte FP23EN      :1;                                       /* Frontplane Output Enable Bit 23 */
  } Bits;
} LCDFPENR2STR;
extern volatile LCDFPENR2STR _LCDFPENR2 @0x00000A04;
#define LCDFPENR2                       _LCDFPENR2.Byte
#define LCDFPENR2_FP16EN                _LCDFPENR2.Bits.FP16EN
#define LCDFPENR2_FP17EN                _LCDFPENR2.Bits.FP17EN
#define LCDFPENR2_FP18EN                _LCDFPENR2.Bits.FP18EN
#define LCDFPENR2_FP19EN                _LCDFPENR2.Bits.FP19EN
#define LCDFPENR2_FP20EN                _LCDFPENR2.Bits.FP20EN
#define LCDFPENR2_FP21EN                _LCDFPENR2.Bits.FP21EN
#define LCDFPENR2_FP22EN                _LCDFPENR2.Bits.FP22EN
#define LCDFPENR2_FP23EN                _LCDFPENR2.Bits.FP23EN

#define LCDFPENR2_FP16EN_MASK           1U
#define LCDFPENR2_FP17EN_MASK           2U
#define LCDFPENR2_FP18EN_MASK           4U
#define LCDFPENR2_FP19EN_MASK           8U
#define LCDFPENR2_FP20EN_MASK           16U
#define LCDFPENR2_FP21EN_MASK           32U
#define LCDFPENR2_FP22EN_MASK           64U
#define LCDFPENR2_FP23EN_MASK           128U


/*** LCDFPENR3 - LCD Frontplane Enable Register 3; 0x00000A05 ***/
typedef union {
  byte Byte;
  struct {
    byte FP24EN      :1;                                       /* Frontplane Output Enable Bit 24 */
    byte FP25EN      :1;                                       /* Frontplane Output Enable Bit 25 */
    byte FP26EN      :1;                                       /* Frontplane Output Enable Bit 26 */
    byte FP27EN      :1;                                       /* Frontplane Output Enable Bit 27 */
    byte FP28EN      :1;                                       /* Frontplane Output Enable Bit 28 */
    byte FP29EN      :1;                                       /* Frontplane Output Enable Bit 29 */
    byte FP30EN      :1;                                       /* Frontplane Output Enable Bit 30 */
    byte FP31EN      :1;                                       /* Frontplane Output Enable Bit 31 */
  } Bits;
} LCDFPENR3STR;
extern volatile LCDFPENR3STR _LCDFPENR3 @0x00000A05;
#define LCDFPENR3                       _LCDFPENR3.Byte
#define LCDFPENR3_FP24EN                _LCDFPENR3.Bits.FP24EN
#define LCDFPENR3_FP25EN                _LCDFPENR3.Bits.FP25EN
#define LCDFPENR3_FP26EN                _LCDFPENR3.Bits.FP26EN
#define LCDFPENR3_FP27EN                _LCDFPENR3.Bits.FP27EN
#define LCDFPENR3_FP28EN                _LCDFPENR3.Bits.FP28EN
#define LCDFPENR3_FP29EN                _LCDFPENR3.Bits.FP29EN
#define LCDFPENR3_FP30EN                _LCDFPENR3.Bits.FP30EN
#define LCDFPENR3_FP31EN                _LCDFPENR3.Bits.FP31EN

#define LCDFPENR3_FP24EN_MASK           1U
#define LCDFPENR3_FP25EN_MASK           2U
#define LCDFPENR3_FP26EN_MASK           4U
#define LCDFPENR3_FP27EN_MASK           8U
#define LCDFPENR3_FP28EN_MASK           16U
#define LCDFPENR3_FP29EN_MASK           32U
#define LCDFPENR3_FP30EN_MASK           64U
#define LCDFPENR3_FP31EN_MASK           128U


/*** LCDFPENR4 - LCD Frontplane Enable Register 4; 0x00000A06 ***/
typedef union {
  byte Byte;
  struct {
    byte FP32EN      :1;                                       /* Frontplane Output Enable Bit 32 */
    byte FP33EN      :1;                                       /* Frontplane Output Enable Bit 33 */
    byte FP34EN      :1;                                       /* Frontplane Output Enable Bit 34 */
    byte FP35EN      :1;                                       /* Frontplane Output Enable Bit 35 */
    byte FP36EN      :1;                                       /* Frontplane Output Enable Bit 36 */
    byte FP37EN      :1;                                       /* Frontplane Output Enable Bit 37 */
    byte FP38EN      :1;                                       /* Frontplane Output Enable Bit 38 */
    byte FP39EN      :1;                                       /* Frontplane Output Enable Bit 39 */
  } Bits;
} LCDFPENR4STR;
extern volatile LCDFPENR4STR _LCDFPENR4 @0x00000A06;
#define LCDFPENR4                       _LCDFPENR4.Byte
#define LCDFPENR4_FP32EN                _LCDFPENR4.Bits.FP32EN
#define LCDFPENR4_FP33EN                _LCDFPENR4.Bits.FP33EN
#define LCDFPENR4_FP34EN                _LCDFPENR4.Bits.FP34EN
#define LCDFPENR4_FP35EN                _LCDFPENR4.Bits.FP35EN
#define LCDFPENR4_FP36EN                _LCDFPENR4.Bits.FP36EN
#define LCDFPENR4_FP37EN                _LCDFPENR4.Bits.FP37EN
#define LCDFPENR4_FP38EN                _LCDFPENR4.Bits.FP38EN
#define LCDFPENR4_FP39EN                _LCDFPENR4.Bits.FP39EN

#define LCDFPENR4_FP32EN_MASK           1U
#define LCDFPENR4_FP33EN_MASK           2U
#define LCDFPENR4_FP34EN_MASK           4U
#define LCDFPENR4_FP35EN_MASK           8U
#define LCDFPENR4_FP36EN_MASK           16U
#define LCDFPENR4_FP37EN_MASK           32U
#define LCDFPENR4_FP38EN_MASK           64U
#define LCDFPENR4_FP39EN_MASK           128U


/*** LCDRAM0 - LCD RAM 0; 0x00000A08 ***/
typedef union {
  byte Byte;
  struct {
    byte FP0BP0      :1;                                       /* LCD Segment FP0, BP0 ON */
    byte FP0BP1      :1;                                       /* LCD Segment FP0, BP1 ON */
    byte FP0BP2      :1;                                       /* LCD Segment FP0, BP2 ON */
    byte FP0BP3      :1;                                       /* LCD Segment FP0, BP3 ON */
    byte FP1BP0      :1;                                       /* LCD Segment FP1, BP0 ON */
    byte FP1BP1      :1;                                       /* LCD Segment FP1, BP1 ON */
    byte FP1BP2      :1;                                       /* LCD Segment FP1, BP2 ON */
    byte FP1BP3      :1;                                       /* LCD Segment FP1, BP3 ON */
  } Bits;
  struct {
    byte grpFP0BP :4;
    byte grpFP1BP :4;
  } MergedBits;
} LCDRAM0STR;
extern volatile LCDRAM0STR _LCDRAM0 @0x00000A08;
#define LCDRAM0                         _LCDRAM0.Byte
#define LCDRAM0_FP0BP0                  _LCDRAM0.Bits.FP0BP0
#define LCDRAM0_FP0BP1                  _LCDRAM0.Bits.FP0BP1
#define LCDRAM0_FP0BP2                  _LCDRAM0.Bits.FP0BP2
#define LCDRAM0_FP0BP3                  _LCDRAM0.Bits.FP0BP3
#define LCDRAM0_FP1BP0                  _LCDRAM0.Bits.FP1BP0
#define LCDRAM0_FP1BP1                  _LCDRAM0.Bits.FP1BP1
#define LCDRAM0_FP1BP2                  _LCDRAM0.Bits.FP1BP2
#define LCDRAM0_FP1BP3                  _LCDRAM0.Bits.FP1BP3
/* LCDRAM_ARR: Access 20 LCDRAMx registers in an array */
#define LCDRAM_ARR                      ((volatile byte *) &LCDRAM0)
#define LCDRAM0_FP0BP                   _LCDRAM0.MergedBits.grpFP0BP
#define LCDRAM0_FP1BP                   _LCDRAM0.MergedBits.grpFP1BP

#define LCDRAM0_FP0BP0_MASK             1U
#define LCDRAM0_FP0BP1_MASK             2U
#define LCDRAM0_FP0BP2_MASK             4U
#define LCDRAM0_FP0BP3_MASK             8U
#define LCDRAM0_FP1BP0_MASK             16U
#define LCDRAM0_FP1BP1_MASK             32U
#define LCDRAM0_FP1BP2_MASK             64U
#define LCDRAM0_FP1BP3_MASK             128U
#define LCDRAM0_FP0BP_MASK              15U
#define LCDRAM0_FP0BP_BITNUM            0U
#define LCDRAM0_FP1BP_MASK              240U
#define LCDRAM0_FP1BP_BITNUM            4U


/*** LCDRAM1 - LCD RAM 1; 0x00000A09 ***/
typedef union {
  byte Byte;
  struct {
    byte FP2BP0      :1;                                       /* LCD Segment FP2, BP0 ON */
    byte FP2BP1      :1;                                       /* LCD Segment FP2, BP1 ON */
    byte FP2BP2      :1;                                       /* LCD Segment FP2, BP2 ON */
    byte FP2BP3      :1;                                       /* LCD Segment FP2, BP3 ON */
    byte FP3BP0      :1;                                       /* LCD Segment FP3, BP0 ON */
    byte FP3BP1      :1;                                       /* LCD Segment FP3, BP1 ON */
    byte FP3BP2      :1;                                       /* LCD Segment FP3, BP2 ON */
    byte FP3BP3      :1;                                       /* LCD Segment FP3, BP3 ON */
  } Bits;
  struct {
    byte grpFP2BP :4;
    byte grpFP3BP :4;
  } MergedBits;
} LCDRAM1STR;
extern volatile LCDRAM1STR _LCDRAM1 @0x00000A09;
#define LCDRAM1                         _LCDRAM1.Byte
#define LCDRAM1_FP2BP0                  _LCDRAM1.Bits.FP2BP0
#define LCDRAM1_FP2BP1                  _LCDRAM1.Bits.FP2BP1
#define LCDRAM1_FP2BP2                  _LCDRAM1.Bits.FP2BP2
#define LCDRAM1_FP2BP3                  _LCDRAM1.Bits.FP2BP3
#define LCDRAM1_FP3BP0                  _LCDRAM1.Bits.FP3BP0
#define LCDRAM1_FP3BP1                  _LCDRAM1.Bits.FP3BP1
#define LCDRAM1_FP3BP2                  _LCDRAM1.Bits.FP3BP2
#define LCDRAM1_FP3BP3                  _LCDRAM1.Bits.FP3BP3
#define LCDRAM1_FP2BP                   _LCDRAM1.MergedBits.grpFP2BP
#define LCDRAM1_FP3BP                   _LCDRAM1.MergedBits.grpFP3BP

#define LCDRAM1_FP2BP0_MASK             1U
#define LCDRAM1_FP2BP1_MASK             2U
#define LCDRAM1_FP2BP2_MASK             4U
#define LCDRAM1_FP2BP3_MASK             8U
#define LCDRAM1_FP3BP0_MASK             16U
#define LCDRAM1_FP3BP1_MASK             32U
#define LCDRAM1_FP3BP2_MASK             64U
#define LCDRAM1_FP3BP3_MASK             128U
#define LCDRAM1_FP2BP_MASK              15U
#define LCDRAM1_FP2BP_BITNUM            0U
#define LCDRAM1_FP3BP_MASK              240U
#define LCDRAM1_FP3BP_BITNUM            4U


