ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
#define RTZ3CTL_STEP_MASK               3U
#define RTZ3CTL_STEP_BITNUM             0U
#define RTZ3CTL_POL_MASK                16U
#define RTZ3CTL_RCIR_MASK               32U
#define RTZ3CTL_DCOIL_MASK              64U
#define RTZ3CTL_ITG_MASK                128U


/*** MDC3CTL - SSD3 Modulus Down Counter Control Register; 0x00000AB1 ***/
typedef union {
  byte Byte;
  struct {
    byte AOVIE       :1;                                       /* Accumulator Overflow Interrupt Enable */
    byte             :1; 
    byte MCEN        :1;                                       /* Modulus Down-Counter Enable */
    byte FLMC        :1;                                       /* Force Load Register into the Modulus Counter Count Register */
    byte PRE         :1;                                       /* Prescaler */
    byte RDMCL       :1;                                       /* Read Modulus Down-Counter Load */
    byte MODMC       :1;                                       /* Modulus Mode Enable */
    byte MCZIE       :1;                                       /* Modulus Counter Underflow Interrupt Enable */
  } Bits;
} MDC3CTLSTR;
extern volatile MDC3CTLSTR _MDC3CTL @0x00000AB1;
#define MDC3CTL                         _MDC3CTL.Byte
#define MDC3CTL_AOVIE                   _MDC3CTL.Bits.AOVIE
#define MDC3CTL_MCEN                    _MDC3CTL.Bits.MCEN
#define MDC3CTL_FLMC                    _MDC3CTL.Bits.FLMC
#define MDC3CTL_PRE                     _MDC3CTL.Bits.PRE
#define MDC3CTL_RDMCL                   _MDC3CTL.Bits.RDMCL
#define MDC3CTL_MODMC                   _MDC3CTL.Bits.MODMC
#define MDC3CTL_MCZIE                   _MDC3CTL.Bits.MCZIE

#define MDC3CTL_AOVIE_MASK              1U
#define MDC3CTL_MCEN_MASK               4U
#define MDC3CTL_FLMC_MASK               8U
#define MDC3CTL_PRE_MASK                16U
#define MDC3CTL_RDMCL_MASK              32U
#define MDC3CTL_MODMC_MASK              64U
#define MDC3CTL_MCZIE_MASK              128U


/*** SSD3CTL - SSD3 Stepper Stall Detector Control Register; 0x00000AB2 ***/
typedef union {
  byte Byte;
  struct {
    byte ACLKS       :2;                                       /* Accumulator Sample Frequency Select */
    byte             :1; 
    byte             :1; 
    byte FTST        :1;                                       /* Factory Test */
    byte SSDWAI      :1;                                       /* SSD Disabled during Wait Mode */
    byte SDCPU       :1;                                       /* Sigma-Delta Converter Power Up */
    byte RTZE        :1;                                       /* Return to Zero Enable */
  } Bits;
} SSD3CTLSTR;
extern volatile SSD3CTLSTR _SSD3CTL @0x00000AB2;
#define SSD3CTL                         _SSD3CTL.Byte
#define SSD3CTL_ACLKS                   _SSD3CTL.Bits.ACLKS
#define SSD3CTL_FTST                    _SSD3CTL.Bits.FTST
#define SSD3CTL_SSDWAI                  _SSD3CTL.Bits.SSDWAI
#define SSD3CTL_SDCPU                   _SSD3CTL.Bits.SDCPU
#define SSD3CTL_RTZE                    _SSD3CTL.Bits.RTZE

#define SSD3CTL_ACLKS_MASK              3U
#define SSD3CTL_ACLKS_BITNUM            0U
#define SSD3CTL_FTST_MASK               16U
#define SSD3CTL_SSDWAI_MASK             32U
#define SSD3CTL_SDCPU_MASK              64U
#define SSD3CTL_RTZE_MASK               128U


/*** SSD3FLG - SSD3 Stepper Stall Detector Flag Register; 0x00000AB3 ***/
typedef union {
  byte Byte;
  struct {
    byte AOVIF       :1;                                       /* Accumulator Overflow Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte MCZIF       :1;                                       /* Modulus Counter Underflow Interrupt Flag */
  } Bits;
} SSD3FLGSTR;
extern volatile SSD3FLGSTR _SSD3FLG @0x00000AB3;
#define SSD3FLG                         _SSD3FLG.Byte
#define SSD3FLG_AOVIF                   _SSD3FLG.Bits.AOVIF
#define SSD3FLG_MCZIF                   _SSD3FLG.Bits.MCZIF

#define SSD3FLG_AOVIF_MASK              1U
#define SSD3FLG_MCZIF_MASK              128U


/*** MDC3CNT - SSD3 Modulus Down-Counter Count Register; 0x00000AB4 ***/
typedef union {
  word Word;
  struct {
    word MDCCNT      :16;                                      /* Modulus Down Counter */
  } Bits;
} MDC3CNTSTR;
extern volatile MDC3CNTSTR _MDC3CNT @0x00000AB4;
#define MDC3CNT                         _MDC3CNT.Word
#define MDC3CNT_MDCCNT                  _MDC3CNT.Bits.MDCCNT

#define MDC3CNT_MDCCNT_MASK             65535U
#define MDC3CNT_MDCCNT_BITNUM           0U


/*** ITG3ACC - SSD3 Integration Accumulator Register; 0x00000AB6 ***/
typedef union {
  word Word;
  struct {
    word ITGACC      :16;                                      /* Integration Accumulator */
  } Bits;
} ITG3ACCSTR;
extern volatile ITG3ACCSTR _ITG3ACC @0x00000AB6;
#define ITG3ACC                         _ITG3ACC.Word
#define ITG3ACC_ITGACC                  _ITG3ACC.Bits.ITGACC

#define ITG3ACC_ITGACC_MASK             65535U
#define ITG3ACC_ITGACC_BITNUM           0U


/*** RTCCTL1 - RTC Control Register 1; 0x00000AE0 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte COMPE       :1;                                       /* RTC Compensation Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RTCEN       :1;                                       /* RTC Enable */
  } Bits;
} RTCCTL1STR;
extern volatile RTCCTL1STR _RTCCTL1 @0x00000AE0;
#define RTCCTL1                         _RTCCTL1.Byte
#define RTCCTL1_COMPE                   _RTCCTL1.Bits.COMPE
#define RTCCTL1_RTCEN                   _RTCCTL1.Bits.RTCEN

#define RTCCTL1_COMPE_MASK              2U
#define RTCCTL1_RTCEN_MASK              128U


/*** RTCCTL2 - RTC Control Register 2; 0x00000AE1 ***/
typedef union {
  byte Byte;
  struct {
    byte RTCPS       :4;                                       /* RTC main OSC prescaler Bits */
    byte             :1; 
    byte             :1; 
    byte CLKSRC      :1;                                       /* RTC Clock Source Selection */
    byte             :1; 
  } Bits;
} RTCCTL2STR;
