ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
extern volatile RTCCTL2STR _RTCCTL2 @0x00000AE1;
#define RTCCTL2                         _RTCCTL2.Byte
#define RTCCTL2_RTCPS                   _RTCCTL2.Bits.RTCPS
#define RTCCTL2_CLKSRC                  _RTCCTL2.Bits.CLKSRC

#define RTCCTL2_RTCPS_MASK              15U
#define RTCCTL2_RTCPS_BITNUM            0U
#define RTCCTL2_CLKSRC_MASK             64U


/*** RTCCTL3 - RTC Control Register 3; 0x00000AE2 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte CALS        :1;                                       /* RTC Calibration Clock Selection */
    byte             :1; 
    byte FRZ         :1;                                       /* RTC Stop in Freeze Mode */
    byte             :1; 
    byte             :1; 
    byte RTCWE       :2;                                       /* RTC Module Write Enable Bits */
  } Bits;
} RTCCTL3STR;
extern volatile RTCCTL3STR _RTCCTL3 @0x00000AE2;
#define RTCCTL3                         _RTCCTL3.Byte
#define RTCCTL3_CALS                    _RTCCTL3.Bits.CALS
#define RTCCTL3_FRZ                     _RTCCTL3.Bits.FRZ
#define RTCCTL3_RTCWE                   _RTCCTL3.Bits.RTCWE

#define RTCCTL3_CALS_MASK               2U
#define RTCCTL3_FRZ_MASK                8U
#define RTCCTL3_RTCWE_MASK              192U
#define RTCCTL3_RTCWE_BITNUM            6U


/*** RTCCTL4 - RTC Control Register 4; 0x00000AE3 ***/
typedef union {
  byte Byte;
  struct {
    byte TB0IE       :1;                                       /* 4 HZ Time Tick interrupt Enable */
    byte             :1; 
    byte COMPIE      :1;                                       /* Compensation cycle Interrupt Enable */
    byte SECIE       :1;                                       /* Second Interrupt Enable */
    byte MINIE       :1;                                       /* Minute Interrupt Enable */
    byte HRIE        :1;                                       /* Hour Interrupt Enable */
    byte             :1; 
    byte             :1; 
  } Bits;
} RTCCTL4STR;
extern volatile RTCCTL4STR _RTCCTL4 @0x00000AE3;
#define RTCCTL4                         _RTCCTL4.Byte
#define RTCCTL4_TB0IE                   _RTCCTL4.Bits.TB0IE
#define RTCCTL4_COMPIE                  _RTCCTL4.Bits.COMPIE
#define RTCCTL4_SECIE                   _RTCCTL4.Bits.SECIE
#define RTCCTL4_MINIE                   _RTCCTL4.Bits.MINIE
#define RTCCTL4_HRIE                    _RTCCTL4.Bits.HRIE

#define RTCCTL4_TB0IE_MASK              1U
#define RTCCTL4_COMPIE_MASK             4U
#define RTCCTL4_SECIE_MASK              8U
#define RTCCTL4_MINIE_MASK              16U
#define RTCCTL4_HRIE_MASK               32U


/*** RTCS1 - RTC Status Register 1; 0x00000AE4 ***/
typedef union {
  byte Byte;
  struct {
    byte TB0F        :1;                                       /* 4 Hz time tick interrupt flag */
    byte             :1; 
    byte COMPF       :1;                                       /* Compensation cycle interrupt flag */
    byte SECF        :1;                                       /* Second interrupt flag */
    byte MINF        :1;                                       /* Minute interrupt flag */
    byte HRF         :1;                                       /* Hour interrupt flag */
    byte             :1; 
    byte CDLC        :1;                                       /* Compensation Data Load Cycle */
  } Bits;
} RTCS1STR;
extern volatile RTCS1STR _RTCS1 @0x00000AE4;
#define RTCS1                           _RTCS1.Byte
#define RTCS1_TB0F                      _RTCS1.Bits.TB0F
#define RTCS1_COMPF                     _RTCS1.Bits.COMPF
#define RTCS1_SECF                      _RTCS1.Bits.SECF
#define RTCS1_MINF                      _RTCS1.Bits.MINF
#define RTCS1_HRF                       _RTCS1.Bits.HRF
#define RTCS1_CDLC                      _RTCS1.Bits.CDLC

#define RTCS1_TB0F_MASK                 1U
#define RTCS1_COMPF_MASK                4U
#define RTCS1_SECF_MASK                 8U
#define RTCS1_MINF_MASK                 16U
#define RTCS1_HRF_MASK                  32U
#define RTCS1_CDLC_MASK                 128U


/*** RTCCCR - RTC Compensation Configure Register; 0x00000AE5 ***/
typedef union {
  byte Byte;
  struct {
    byte Q           :6;                                       /* Q value Bits */
    byte CCS         :2;                                       /* Compensation cycle selection Bits */
  } Bits;
} RTCCCRSTR;
extern volatile RTCCCRSTR _RTCCCR @0x00000AE5;
#define RTCCCR                          _RTCCCR.Byte
#define RTCCCR_Q                        _RTCCCR.Bits.Q
#define RTCCCR_CCS                      _RTCCCR.Bits.CCS

#define RTCCCR_Q_MASK                   63U
#define RTCCCR_Q_BITNUM                 0U
#define RTCCCR_CCS_MASK                 192U
#define RTCCCR_CCS_BITNUM               6U


/*** RTCMOD - RTC Modulo Register; 0x00000AE6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** RTCMODH - RTC Modulo High Register; 0x00000AE6 ***/
    union {
      byte Byte;
    } RTCMODHSTR;
    #define RTCMODH                     _RTCMOD.Overlap_STR.RTCMODHSTR.Byte
    

    /*** RTCMODL - RTC Modulo Low Register; 0x00000AE7 ***/
    union {
      byte Byte;
    } RTCMODLSTR;
    #define RTCMODL                     _RTCMOD.Overlap_STR.RTCMODLSTR.Byte
    
  } Overlap_STR;

  struct {
    word RTCMODL_grp :8;                                       /* RTC Modulo Bits */ /*Warning: group name is duplicated with register name*/
    word RTCMODH_grp :8;                                       /* RTC Modulo Bit8 */ /*Warning: group name is duplicated with register name*/
  } Bits;
} RTCMODSTR;
extern volatile RTCMODSTR _RTCMOD @0x00000AE6;
#define RTCMOD                          _RTCMOD.Word
#define RTCMOD_RTCMODL                  _RTCMOD.Bits.RTCMODL_grp
#define RTCMOD_RTCMODH                  _RTCMOD.Bits.RTCMODH_grp

#define RTCMOD_RTCMODL_MASK             255U
#define RTCMOD_RTCMODL_BITNUM           0U
#define RTCMOD_RTCMODH_MASK             65280U
#define RTCMOD_RTCMODH_BITNUM           8U


