ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVH128_Master/Project_Headers/mc9s12zvh128.h
/*** RTCCNT - RTC Counter Register; 0x00000AE8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** RTCCNTH - RTC Counter Register High; 0x00000AE8 ***/
    union {
      byte Byte;
    } RTCCNTHSTR;
    #define RTCCNTH                     _RTCCNT.Overlap_STR.RTCCNTHSTR.Byte
    

    /*** RTCCNTL - RTC Counter Register Low; 0x00000AE9 ***/
    union {
      byte Byte;
    } RTCCNTLSTR;
    #define RTCCNTL                     _RTCCNT.Overlap_STR.RTCCNTLSTR.Byte
    
  } Overlap_STR;

  struct {
    word RTCCNTL_grp :8;                                       /* RTC Count Bits */ /*Warning: group name is duplicated with register name*/
    word RTCCNTH_grp :8;                                       /* RTC Count Bit8 */ /*Warning: group name is duplicated with register name*/
  } Bits;
} RTCCNTSTR;
extern volatile RTCCNTSTR _RTCCNT @0x00000AE8;
#define RTCCNT                          _RTCCNT.Word
#define RTCCNT_RTCCNTL                  _RTCCNT.Bits.RTCCNTL_grp
#define RTCCNT_RTCCNTH                  _RTCCNT.Bits.RTCCNTH_grp

#define RTCCNT_RTCCNTL_MASK             255U
#define RTCCNT_RTCCNTL_BITNUM           0U
#define RTCCNT_RTCCNTH_MASK             65280U
#define RTCCNT_RTCCNTH_BITNUM           8U


/*** RTCSECR - Second Register; 0x00000AED ***/
typedef union {
  byte Byte;
  struct {
    byte SEC         :6;                                       /* Second Counter Value Bits */
    byte             :1; 
    byte             :1; 
  } Bits;
} RTCSECRSTR;
extern volatile RTCSECRSTR _RTCSECR @0x00000AED;
#define RTCSECR                         _RTCSECR.Byte
#define RTCSECR_SEC                     _RTCSECR.Bits.SEC

#define RTCSECR_SEC_MASK                63U
#define RTCSECR_SEC_BITNUM              0U


/*** RTCMINR - Minute Register; 0x00000AEE ***/
typedef union {
  byte Byte;
  struct {
    byte MIN         :6;                                       /* MInute Counter Value Bits */
    byte             :1; 
    byte             :1; 
  } Bits;
} RTCMINRSTR;
extern volatile RTCMINRSTR _RTCMINR @0x00000AEE;
#define RTCMINR                         _RTCMINR.Byte
#define RTCMINR_MIN                     _RTCMINR.Bits.MIN

#define RTCMINR_MIN_MASK                63U
#define RTCMINR_MIN_BITNUM              0U


/*** RTCHRR - Hour Register; 0x00000AEF ***/
typedef union {
  byte Byte;
  struct {
    byte HR          :5;                                       /* Hour Counter Value Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} RTCHRRSTR;
extern volatile RTCHRRSTR _RTCHRR @0x00000AEF;
#define RTCHRR                          _RTCHRR.Byte
#define RTCHRR_HR                       _RTCHRR.Bits.HR

#define RTCHRR_HR_MASK                  31U
#define RTCHRR_HR_BITNUM                0U


/*** SSG0CR - SSG Control Register; 0x00000B00 ***/
typedef union {
  byte Byte;
  struct {
    byte STP         :1;                                       /* SSG STOP */
    byte RDR         :1;                                       /* SSG Register Data Ready */
    byte OMS         :1;                                       /* SSG Output Mode Selection */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte SSGE        :1;                                       /* SSG Enable */
  } Bits;
} SSG0CRSTR;
extern volatile SSG0CRSTR _SSG0CR @0x00000B00;
#define SSG0CR                          _SSG0CR.Byte
#define SSG0CR_STP                      _SSG0CR.Bits.STP
#define SSG0CR_RDR                      _SSG0CR.Bits.RDR
#define SSG0CR_OMS                      _SSG0CR.Bits.OMS
#define SSG0CR_SSGE                     _SSG0CR.Bits.SSGE

#define SSG0CR_STP_MASK                 1U
#define SSG0CR_RDR_MASK                 2U
#define SSG0CR_OMS_MASK                 4U
#define SSG0CR_SSGE_MASK                128U


/*** SSG0ADC - SSG attack/decay control register; 0x00000B01 ***/
typedef union {
  byte Byte;
  struct {
    byte ADS         :1;                                       /* SSG Decay or attack Selection */
    byte ADM         :2;                                       /* SSG Linear, Gong or Exponential attack/decay Selection */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ADE         :1;                                       /* SSG attack/decay enable */
  } Bits;
} SSG0ADCSTR;
extern volatile SSG0ADCSTR _SSG0ADC @0x00000B01;
#define SSG0ADC                         _SSG0ADC.Byte
#define SSG0ADC_ADS                     _SSG0ADC.Bits.ADS
#define SSG0ADC_ADM                     _SSG0ADC.Bits.ADM
#define SSG0ADC_ADE                     _SSG0ADC.Bits.ADE

#define SSG0ADC_ADS_MASK                1U
#define SSG0ADC_ADM_MASK                6U
#define SSG0ADC_ADM_BITNUM              1U
#define SSG0ADC_ADE_MASK                128U


/*** SSG0PS - SSG Clock Prescaler Register; 0x00000B02 ***/
typedef union {
  word Word;
  struct {
    word PS          :11;                                      /* SSG Decay or attack Selection */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
} SSG0PSSTR;
extern volatile SSG0PSSTR _SSG0PS @0x00000B02;
#define SSG0PS                          _SSG0PS.Word
#define SSG0PS_PS                       _SSG0PS.Bits.PS

#define SSG0PS_PS_MASK                  2047U
#define SSG0PS_PS_BITNUM                0U


/*** SSG0TONE - SSG Tone Register; 0x00000B04 ***/
typedef union {
  word Word;
  struct {
    word TONE        :10;                                      /* SSG Tone Register Bits */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
} SSG0TONESTR;
extern volatile SSG0TONESTR _SSG0TONE @0x00000B04;
#define SSG0TONE                        _SSG0TONE.Word
#define SSG0TONE_TONE                   _SSG0TONE.Bits.TONE

#define SSG0TONE_TONE_MASK              1023U
#define SSG0TONE_TONE_BITNUM            0U


/*** SSG0AMP - SSG Amplitude Register; 0x00000B06 ***/
typedef union {
  word Word;
  struct {
    word AMP         :11;                                      /* SSG Amplitude Register Bits */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
} SSG0AMPSTR;
extern volatile SSG0AMPSTR _SSG0AMP @0x00000B06;
#define SSG0AMP                         _SSG0AMP.Word
#define SSG0AMP_AMP                     _SSG0AMP.Bits.AMP

